app/controllers/crops_controller.rb

  def index
    @crops = Crop.all
---
SELECT "crops".* FROM "crops"

  def create
    @crop = Crop.new(crop_params)

    respond_to do |format|
      if @crop.save
---
INSERT INTO "crops" ("name", "season", "created_at", "updated_at", "farm_id") VALUES (?, ?, ?, ?, ?)  [["name", "d"], ["season", "d"], ["created_at", "2017-12-01 05:52:07.076232"], ["updated_at", "2017-12-01 05:52:07.076232"], ["farm_id", 1]]

  def update
    respond_to do |format|
      if @crop.update(crop_params)
---
UPDATE "crops" SET "name" = ?, "season" = ?, "updated_at" = ? WHERE "crops"."id" = ?  [["name", "Urad"], ["season", "Rhabi"], ["updated_at", "2017-12-02 16:12:45.822520"], ["id", 1]]

  def destroy
    @crop.destroy
---
DELETE FROM "crops" WHERE "crops"."id" = ?  [["id", 14]]

    def set_crop
      @crop = Crop.find(params[:id])
---
SELECT  "crops".* FROM "crops" WHERE "crops"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]