app/controllers/finances_controller.rb

  def index
    @finances = Finance.all
---
SELECT "finances".* FROM "finances"

  def create
    @finance = Finance.new(finance_params)

    respond_to do |format|
      if @finance.save
---
INSERT INTO "finances" ("outstanding_loan", "interest_rate", "created_at", "updated_at", "farm_id", "budget", "crop_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["outstanding_loan", 3.0], ["interest_rate", 3.0], ["created_at", "2017-12-02 16:04:14.396489"], ["updated_at", "2017-12-02 16:04:14.396489"], ["farm_id", 12], ["budget", 3], ["crop_id", 17]]

  def update
    respond_to do |format|
      if @finance.update(finance_params)
---
UPDATE "finances" SET "interest_rate" = ?, "updated_at" = ? WHERE "finances"."id" = ?  [["interest_rate", 3.3], ["updated_at", "2017-12-01 06:12:37.437187"], ["id", 2]]

  def destroy
    @finance.destroy
---
DELETE FROM "finances" WHERE "finances"."id" = ?  [["id", 3]]

    def set_finance
      @finance = Finance.find(params[:id])
---
SELECT  "finances".* FROM "finances" WHERE "finances"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]