app/controllers/pages_controller.rb

    def show

      # puts params.inspect
      @crop_id = params[:crop_id] unless params[:crop_id].nil?
      @farm_id = params[:farm] unless params[:farm].nil?
      @fin_id = params[:fin] unless params[:fin].nil?

      @farm = Farm.find(@farm_id)
      # @farm = Farm.first
      @district = Farm::DISTRICTS.find_index(@farm.location)
      @area = @farm.size

      @crop = Crop.find(@crop_id)
      @season_num = Crop::SEASONS.find_index(@crop.season)

      @finance = Finance.find(@fin_id)
---
SELECT  "farms".* FROM "farms" WHERE "farms"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "farms".* FROM "farms" ORDER BY "farms"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "crops".* FROM "crops" WHERE "crops"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT  "finances".* FROM "finances" WHERE "finances"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]